# Cinematic Returns: Unveiling the Art and Science of Movie Profitability

# Overview

Our company is entering a new market and has created a movie studio. This analysis uses statistical methods to provide actionable insights into movie profitability and identify peak times for movie releases.

# Business Understanding

The film industry has almost always been considered to be unpredictable and volatile. Despite this, certain production companies thrive within this market. This market analysis aims to identify some underlying factors that may contribute to a movie's box office success. We are aiming to answer these questions:

    - Which genre of movies have the highest ROI?
    - What is the best time to release films for maximum profitability?
    - Is there a direct positive relationship between the amount spent on a movie and the profitability?

## Reading Data

In [8]:
import pandas as pd
import numpy as np
import scipy.stats as stats
import sqlite3
import re
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

bom_movie_gross

In [9]:
bom_movie_gross=pd.read_csv('Data/bom.movie_gross.csv.gz' , compression='gzip')

In [10]:
#pd.options.display.max_columns=100

The data base

In [11]:
conn1=sqlite3.connect('Data/im.db/im.db')

In [12]:
query=("""
SELECT *
FROM movie_basics

""")
movie_basics=pd.read_sql(query,conn1)

movie_info

In [13]:
movie_info=pd.read_csv('Data/rt.movie_info.tsv.gz' , delimiter='\t' ,compression='gzip')

reviews

In [14]:
reviews=pd.read_csv('Data/rt.reviews.tsv.gz' , delimiter='\t' ,compression='gzip' , encoding='windows-1252')

The movie data base

In [15]:
tmdb_df=pd.read_csv('Data/tmdb.movies.csv.gz',compression='gzip' , index_col=0)

movie_budget

In [16]:
movie_budget=pd.read_csv('Data/tn.movie_budgets.csv.gz' , compression='gzip')

## Exploring and Cleaning of Data

###### bom_movie_gross cleaning and checking data

In [17]:
bom_movie_gross.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [18]:
bom_movie_gross.sort_values('domestic_gross' , ascending=False)

,title,studio,domestic_gross,foreign_gross,year
1872,Star Wars: The Force Awakens,BV,936700000.0,"1,131.6",2015
3080,Black Panther,BV,700100000.0,646900000,2018
3079,Avengers: Infinity War,BV,678800000.0,"1,369.5",2018
1873,Jurassic World,Uni.,652300000.0,"1,019.4",2015
727,Marvel's The Avengers,BV,623400000.0,895500000,2012
...,...,...,...,...,...
1975,Surprise - Journey To The West,AR,NaN,49600000,2015
2392,Finding Mr. Right 2,CL,NaN,114700000,2016
2468,Solace,LGP,NaN,22400000,2016
2595,Viral,W/Dim.,NaN,552000,2016
2825,Secret Superstar,NaN,NaN,122000000,2017

In [19]:
#bom_movie_gross.loc[bom_movie_gross['foreign_gross'].str.contains('\d' , regex=True , na=False)]
for index , val in bom_movie_gross.foreign_gross.items():
    #if isinstance(val, str) and re.search((r'\d*\.\d+') , str(val)):
    if re.search((r'\d*\.\d+') , str(val)):
        spl_val=val.split('.')
        val=spl_val[0]+('0'*int(spl_val[1]))
        bom_movie_gross.at[index,'foreign_gross']=str(val)

In [20]:
#changing foreign gross column in to float data type
bom_movie_gross['foreign_gross'] = bom_movie_gross['foreign_gross'].str.replace(',' , '')

In [21]:
#filled null values with zero instead of droping , because we can have it from other data
bom_movie_gross=bom_movie_gross.fillna(0)

In [22]:
cols=['domestic_gross','foreign_gross']
bom_movie_gross[cols]=bom_movie_gross[cols].astype(int)

In [23]:
# created new column world wide profit
bom_movie_gross['world_wide_profit']=bom_movie_gross.foreign_gross+bom_movie_gross.domestic_gross

In [24]:
bom_movie_gross.sort_values('domestic_gross' , ascending=False)

,title,studio,domestic_gross,foreign_gross,year,world_wide_profit
1872,Star Wars: The Force Awakens,BV,936700000,1131000000,2015,2067700000
3080,Black Panther,BV,700100000,646900000,2018,1347000000
3079,Avengers: Infinity War,BV,678800000,136900000,2018,815700000
1873,Jurassic World,Uni.,652300000,10190000,2015,662490000
727,Marvel's The Avengers,BV,623400000,895500000,2012,1518900000
...,...,...,...,...,...,...
936,"Lula, Son of Brazil",NYer,0,3800000,2012,3800000
1079,The Green Wave,RF,0,70100,2012,70100
1975,Surprise - Journey To The West,AR,0,49600000,2015,49600000
966,The Cup (2012),Myr.,0,1800000,2012,1800000
537,Force,FoxS,0,4800000,2011,4800000

In [25]:
bom_movie_gross.head()

,title,studio,domestic_gross,foreign_gross,year,world_wide_profit
0,Toy Story 3,BV,415000000,652000000,2010,1067000000
1,Alice in Wonderland (2010),BV,334200000,691300000,2010,1025500000
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000,664300000,2010,960300000
3,Inception,WB,292600000,535700000,2010,828300000
4,Shrek Forever After,P/DW,238700000,513900000,2010,752600000

In [26]:
bom_movie_gross.isna().sum()

title                0
studio               0
domestic_gross       0
foreign_gross        0
year                 0
world_wide_profit    0
dtype: int64

In [27]:
bom_movie_gross.shape

(3387, 6)

###### Movie_info data cleaning

In [28]:
movie_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1560 entries, 0 to 1559
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            1560 non-null   int64
 1   synopsis      1498 non-null   object
 2   rating        1557 non-null   object
 3   genre         1552 non-null   object
 4   director      1361 non-null   object
 5   writer        1111 non-null   object
 6   theater_date  1201 non-null   object
 7   dvd_date      1201 non-null   object
 8   currency      340 non-null    object
 9   box_office    340 non-null    object
 10  runtime       1530 non-null   object
 11  studio        494 non-null    object
dtypes: int64(1), object(11)
memory usage: 146.4+ KB

In [29]:
#droped currency and box_office columns from movie_info because they have a lot of null values
movie_info.drop(["currency" , 'box_office'], axis='columns' , inplace=True)

In [30]:
movie_info.sample(5)

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,runtime,studio
517,678,"In this tear-jerking drama, two star-crossed l...",NR,Drama|Romance,David Miller,William Ludwig|Eleanore Griffin|Fannie Hurst,NaN,NaN,107 minutes,NaN
809,1046,Writer/director Rodrigo Garca (Nine Lives) tea...,R,Drama,NaN,NaN,"May 7, 2010","Dec 14, 2010",126 minutes,Sony Pictures Classics
661,847,"In this Alfred Hitchcock film, Derrick De Marn...",NR,Classics|Drama|Mystery and Suspense,Alfred Hitchcock,Alma Reville|Charles Bennett|Gerald Savory|Edw...,"Feb 17, 1938","Jul 30, 2002",80 minutes,NaN
1074,1385,An unhappy couple discover breaking up really ...,NR,Classics|Comedy,Bud Yorkin,Norman Lear|Robert Kaufman,"Jan 1, 1967","Jan 6, 2004",109 minutes,NaN
698,896,One of special-effects wizard Ray Harryhausen'...,PG,Classics|Horror|Musical and Performing Arts|Sc...,Nathan Juran,Christopher Knopf,"Jun 1, 1957","Jul 31, 2007",84 minutes,NaN

##### Reviews data cleaning

In [31]:
reviews.id.unique()

array([   3,    5,    6, ..., 1998, 1999, 2000], dtype=int64)

In [32]:
reviews.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54432 entries, 0 to 54431
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          54432 non-null  int64
 1   review      48869 non-null  object
 2   rating      40915 non-null  object
 3   fresh       54432 non-null  object
 4   critic      51710 non-null  object
 5   top_critic  54432 non-null  int64
 6   publisher   54123 non-null  object
 7   date        54432 non-null  object
dtypes: int64(2), object(6)
memory usage: 3.3+ MB

In [33]:
#created a new column to have numeric values of fresh column -- fresh=1 and rotten=0
reviews['num_fresh']=""
for index, value in reviews.fresh.items():
    if value=='fresh':
        reviews.at[index , 'num_fresh']=1
    else: reviews.at[index , 'num_fresh']=0

In [34]:
reviews.head()

,id,review,rating,fresh,critic,top_critic,publisher,date,num_fresh
0,3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018",1
1,3,It's an allegory in search of a meaning that n...,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018",0
2,3,... life lived in a bubble in financial dealin...,NaN,fresh,Sean Axmaker,0,Stream on Demand,"January 4, 2018",1
3,3,Continuing along a line introduced in last yea...,NaN,fresh,Daniel Kasman,0,MUBI,"November 16, 2017",1
4,3,... a perverse twist on neorealism...,NaN,fresh,NaN,0,Cinema Scope,"October 12, 2017",1

###### tmdb_df cleaning

In [35]:
#dropped duplicated rows
tmdb_df=tmdb_df.drop_duplicates()

In [36]:
tmdb_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 25497 entries, 0 to 26516
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   genre_ids          25497 non-null  object
 1   id                 25497 non-null  int64
 2   original_language  25497 non-null  object
 3   original_title     25497 non-null  object
 4   popularity         25497 non-null  float64
 5   release_date       25497 non-null  object
 6   title              25497 non-null  object
 7   vote_average       25497 non-null  float64
 8   vote_count         25497 non-null  int64
dtypes: float64(2), int64(2), object(5)
memory usage: 1.9+ MB

In [37]:
genre_map = {28: 'Action', 12: 'Adventure', 16: 'Animation', 35: 'Comedy',
             80: 'Crime', 99: 'Documentary', 18: 'Drama', 10751: 'Family', 
             14: 'Fantasy', 36: 'History', 27: 'Horror', 10402: 'Music', 
             9648: 'Mystery', 10749: 'Romance', 878: 'Science Fiction', 
             10770: 'TV Movie', 53: 'Thriller', 10752: 'War', 37: 'Western'}
#tmdb['genres'] = tmdb['genre_ids'].apply(lambda x: [genre_map[int(genre_id)] for genre_id in eval(x)])
tmdb_df['genres_labels'] = tmdb_df['genre_ids'].apply(lambda x: ', '.join([genre_map[int(genre_id)] for genre_id in eval(x)]))

In [38]:
tmdb_df.head(2)

,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count,genres_labels
0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788,"Adventure, Fantasy, Family"
1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610,"Fantasy, Adventure, Animation, Family"

In [39]:
tmdb_df.loc[tmdb_df.genres_labels.str.contains('Action')].head(20)

,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count,genres_labels
2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368,"Adventure, Action, Science Fiction"
4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186,"Action, Science Fiction, Adventure"
6,"[28, 12, 14, 878]",19995,en,Avatar,26.526,2009-12-18,Avatar,7.4,18676,"Action, Adventure, Fantasy, Science Fiction"
9,"[16, 28, 35, 10751, 878]",38055,en,Megamind,22.855,2010-11-04,Megamind,6.8,3635,"Animation, Action, Comedy, Family, Science Fic..."
12,"[53, 12, 28]",27578,en,The Expendables,21.517,2010-08-03,The Expendables,6.1,4647,"Thriller, Adventure, Action"
16,"[28, 53, 878]",20504,en,The Book of Eli,18.985,2010-01-11,The Book of Eli,6.7,3495,"Action, Thriller, Science Fiction"
18,"[28, 18, 53]",2502,en,The Bourne Supremacy,18.199,2004-07-23,The Bourne Supremacy,7.3,4367,"Action, Drama, Thriller"
20,"[28, 18, 9648, 53]",2501,en,The Bourne Identity,17.935,2002-06-14,The Bourne Identity,7.4,5406,"Action, Drama, Mystery, Thriller"
21,"[28, 35]",37834,en,Knight and Day,17.713,2010-06-23,Knight and Day,6.0,2494,"Action, Comedy"
24,"[53, 28, 12, 35, 80]",34544,en,The A-Team,17.097,2010-06-11,The A-Team,6.3,2703,"Thriller, Action, Adventure, Comedy, Crime"
26,"[28, 35, 80, 53]",9737,en,Bad Boys,16.608,1995-04-07,Bad Boys,6.6,2936,"Action, Comedy, Crime, Thriller"
27,"[28, 12, 10751, 14]",10196,en,The Last Airbender,16.595,2010-07-01,The Last Airbender,4.6,2143,"Action, Adventure, Family, Fantasy"
28,"[28, 878, 12, 53]",34851,en,Predators,16.216,2010-07-03,Predators,6.1,1979,"Action, Science Fiction, Adventure, Thriller"
30,"[28, 53]",38234,en,Undisputed III: Redemption,15.886,2010-05-22,Undisputed III: Redemption,7.4,302,"Action, Thriller"
32,"[28, 53, 878, 12]",95,en,Armageddon,15.799,1998-07-01,Armageddon,6.7,4267,"Action, Thriller, Science Fiction, Adventure"
33,"[28, 18, 9648, 53]",2503,en,The Bourne Ultimatum,15.620,2007-08-03,The Bourne Ultimatum,7.4,4440,"Action, Drama, Mystery, Thriller"
34,"[12, 14, 28]",18823,en,Clash of the Titans,15.574,2010-04-02,Clash of the Titans,5.7,3714,"Adventure, Fantasy, Action"
36,"[28, 12, 18]",20662,en,Robin Hood,15.444,2010-05-14,Robin Hood,6.3,2569,"Action, Adventure, Drama"
40,"[14, 12, 28, 35, 18]",27022,en,The Sorcerer's Apprentice,14.463,2010-07-13,The Sorcerer's Apprentice,5.9,2879,"Fantasy, Adventure, Action, Comedy, Drama"
41,"[28, 35, 10749]",22538,en,Scott Pilgrim vs. the World,14.383,2010-08-13,Scott Pilgrim vs. the World,7.3,3882,"Action, Comedy, Romance"

In [40]:
tmdb_df.isna().sum()

genre_ids            0
id                   0
original_language    0
original_title       0
popularity           0
release_date         0
title                0
vote_average         0
vote_count           0
genres_labels        0
dtype: int64

###### movie_budget cleaning

In [41]:
#casting release date type in to datetime type
movie_budget.release_date=pd.to_datetime(movie_budget.release_date)

In [42]:
# function which helps us to omit $ and , from any column and cast it in to float type
# used dtype=np,int64 to support long integers
def change(data):
    data = data.str.replace('[$,]', '', regex=True)
    return data.astype(dtype=np.int64)

In [43]:
#applied change function to three columns :domestic_gross,worldwide_gross, production_budget using apply method
movie_budget[['domestic_gross', 'worldwide_gross', 'production_budget']] = movie_budget[['domestic_gross', 'worldwide_gross', 'production_budget']].apply(change)

In [44]:
#created net profit by subructing budget from gross
movie_budget['net_profit']= movie_budget['worldwide_gross'] - movie_budget['production_budget']

In [45]:
movie_budget.shape

(5782, 7)

#### Merged bom_movie_gross and movie_budget by title and movie columns respectiviely (inner)

In [46]:
bom_movie_gross.shape

(3387, 6)

In [47]:
movie_budget.shape

(5782, 7)

In [48]:
#merged bom_movie_gross and movie_budget by title and movie columns respectiviely (inner)
gross_budget = pd.merge(bom_movie_gross, movie_budget, how='inner', left_on='title', right_on='movie')

In [49]:
gross_budget.shape

(1247, 13)

==========================================================================

In [50]:
#function for creating a new column which has the values from both tables
#def combine_titles(data , col1,col2):
#    if pd.notna(data[col1]) and pd.notna(data[col2]):
#        return data[col1]
#    elif pd.notna(data[col1]):
#        return data[col1]
#    elif pd.notna(data[col2]):
#        return data[col2]
#    else:return None

Calling the function

In [51]:
#gross_budget['movie_title']=gross_budget.apply(combine_titles ,args=('movie','title'), axis=1)

In [52]:
#gross_budget['domestic_gross']=gross_budget.apply(combine_titles ,args=('domestic_gross_y','domestic_gross_x'), axis=1)

In [53]:
#gross_budget['world_wide_gross_Profit']=gross_budget.apply(combine_titles ,args=('worldwide_gross','world_wide_profit'), axis=1)

In [54]:
# # filling foreign gross null values from domestic gross y - worldwide_gross
# for index,value in enumerate(gross_budget.foreign_gross):
#     if (pd.isna(value) or value==0.0):
#         gross_budget.at[index,'foreign_gross']=gross_budget.world_wide_gross_Profit[index]- gross_budget.domestic_gross[index]

In [55]:
#remove rows with zero values in world_wide_gross
#gross_budget=gross_budget.loc[gross_budget.world_wide_gross_Profit!=0]
#gross_budget=gross_budget.loc[gross_budget.domestic_gross!=0]

=========================================================

In [56]:
#dropped columns which wont help us for analysis and also duplicates
drop_cols=['studio','domestic_gross_x' ,'year','release_date','movie','world_wide_profit','id']
gross_budget.drop(drop_cols , axis=1 , inplace=True)
#gross_budget.set_index('id',inplace=True)

In [57]:
gross_budget.head()

,title,foreign_gross,production_budget,domestic_gross_y,worldwide_gross,net_profit
0,Toy Story 3,652000000,200000000,415004880,1068879522,868879522
1,Inception,535700000,160000000,292576195,835524642,675524642
2,Shrek Forever After,513900000,165000000,238736787,756244673,591244673
3,The Twilight Saga: Eclipse,398000000,68000000,300531751,706102828,638102828
4,Iron Man 2,311500000,170000000,312433331,621156389,451156389

In [58]:
gross_budget.dropna(subset=['net_profit', 'production_budget'], inplace=True)

In [59]:
gross_budget.shape

(1247, 6)

In [60]:
gross_budget.isna().sum()

title                0
foreign_gross        0
production_budget    0
domestic_gross_y     0
worldwide_gross      0
net_profit           0
dtype: int64

In [61]:
#created new column ROI(Return on investment)
gross_budget['ROI']=(gross_budget.net_profit/gross_budget.production_budget)*100

In [62]:
gross_budget.head()

,title,foreign_gross,production_budget,domestic_gross_y,worldwide_gross,net_profit,ROI
0,Toy Story 3,652000000,200000000,415004880,1068879522,868879522,434.439761
1,Inception,535700000,160000000,292576195,835524642,675524642,422.202901
2,Shrek Forever After,513900000,165000000,238736787,756244673,591244673,358.330105
3,The Twilight Saga: Eclipse,398000000,68000000,300531751,706102828,638102828,938.386512
4,Iron Man 2,311500000,170000000,312433331,621156389,451156389,265.386111

In [63]:
gross_budget.loc[gross_budget.title.duplicated()].shape

(9, 7)

In [64]:
gross_budget=gross_budget.loc[gross_budget.title.duplicated()==False]

In [65]:
gross_budget.sort_values('net_profit',ascending=False).head()

,title,foreign_gross,production_budget,domestic_gross_y,worldwide_gross,net_profit,ROI
1154,Avengers: Infinity War,136900000,300000000,678815482,2048134200,1748134200,582.711400
764,Jurassic World,10190000,215000000,652270625,1648854864,1433854864,666.909239
765,Furious 7,1163,190000000,353007020,1518722794,1328722794,699.327786
1155,Black Panther,646900000,200000000,700059566,1348258224,1148258224,574.129112
1156,Jurassic World: Fallen Kingdom,891800000,170000000,417719760,1305772799,1135772799,668.101646

In [66]:
gross_budget.isna().sum()

title                0
foreign_gross        0
production_budget    0
domestic_gross_y     0
worldwide_gross      0
net_profit           0
ROI                  0
dtype: int64

###### Movie_basics cleaning

In [67]:
query=("""
SELECT *
FROM movie_akas
WHERE region=='US'

""")
movie_basics=pd.read_sql(query,conn1)
movie_basics.head()

,movie_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,21,Jurassic World 3D,US,None,None,3-D version,0.0
1,tt0369610,29,Jurassic World,US,None,None,None,0.0
2,tt0369610,2,Ebb Tide,US,None,None,fake working title,0.0
3,tt0369610,36,Jurassic Park IV,US,None,working,None,0.0
4,tt0369610,44,Jurassic Park 4,US,None,None,informal alternative title,0.0

In [68]:
#join movie_basic and movie_rating
query=("""
SELECT *
FROM movie_basics AS mb
     JOIN movie_ratings AS mr 
     USING(movie_id)
""")
movie_basics_rating=pd.read_sql(query,conn1)
movie_basics_rating.head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,77
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama",7.2,43
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama,6.9,4517
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama",6.1,13
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy",6.5,119

#### Merged gross_budget and movie_basic_rating to have the genra

In [69]:
#merging gross_budget & tmdb on left
gross_budget_genre = pd.merge(gross_budget,
                       movie_basics_rating,
                       left_on='title',
                       right_on='primary_title',
                       how='left')

In [70]:
gross_budget_genre=gross_budget_genre.loc[gross_budget_genre.title.duplicated()==False]

In [71]:
#dropped all null values
gross_budget_genre = gross_budget_genre.dropna()

In [72]:
#dropped unwanted cols
drop_col2=['original_title','original_title','primary_title','start_year']
gross_budget_genre.drop(drop_col2 , axis=1 , inplace=True)

In [73]:
gross_budget_genre.head(3)

,title,foreign_gross,production_budget,domestic_gross_y,worldwide_gross,net_profit,ROI,movie_id,runtime_minutes,genres,averagerating,numvotes
0,Toy Story 3,652000000,200000000,415004880,1068879522,868879522,434.439761,tt0435761,103.0,"Adventure,Animation,Comedy",8.3,682218.0
1,Inception,535700000,160000000,292576195,835524642,675524642,422.202901,tt1375666,148.0,"Action,Adventure,Sci-Fi",8.8,1841066.0
2,Shrek Forever After,513900000,165000000,238736787,756244673,591244673,358.330105,tt0892791,93.0,"Adventure,Animation,Comedy",6.3,167532.0

In [74]:
gross_budget_genre.shape

(1147, 12)

In [75]:
#merging gross_budget_genre and tmdb_df to have release date
gross_budget_genre_month = pd.merge(gross_budget_genre, tmdb_df, left_on='title',right_on='original_title', how='inner')

In [76]:
#removing duplicated 
gross_budget_genre_month=gross_budget_genre_month.loc[gross_budget_genre_month.title_x.duplicated()==False]

In [77]:
col_drop=['genre_ids', 'id', 'original_language',
       'original_title','title_y',
       'vote_average', 'vote_count', 'genres_labels']

In [78]:
gross_budget_genre_month=gross_budget_genre_month.drop(col_drop , axis=1)

In [79]:
gross_budget_genre_month.head()

,title_x,foreign_gross,production_budget,domestic_gross_y,worldwide_gross,net_profit,ROI,movie_id,runtime_minutes,genres,averagerating,numvotes,popularity,release_date
0,Toy Story 3,652000000,200000000,415004880,1068879522,868879522,434.439761,tt0435761,103.0,"Adventure,Animation,Comedy",8.3,682218.0,24.445,2010-06-17
1,Inception,535700000,160000000,292576195,835524642,675524642,422.202901,tt1375666,148.0,"Action,Adventure,Sci-Fi",8.8,1841066.0,27.920,2010-07-16
2,Shrek Forever After,513900000,165000000,238736787,756244673,591244673,358.330105,tt0892791,93.0,"Adventure,Animation,Comedy",6.3,167532.0,15.041,2010-05-16
3,The Twilight Saga: Eclipse,398000000,68000000,300531751,706102828,638102828,938.386512,tt1325004,124.0,"Adventure,Drama,Fantasy",5.0,211733.0,20.340,2010-06-23
4,Iron Man 2,311500000,170000000,312433331,621156389,451156389,265.386111,tt1228705,124.0,"Action,Adventure,Sci-Fi",7.0,657690.0,28.515,2010-05-07

In [80]:
gross_budget_genre_month=gross_budget_genre_month.assign(genres=gross_budget_genre_month.genres.str.split(",")).explode('genres')

In [81]:
gross_budget_genre_month['release_month']=pd.to_datetime(gross_budget_genre_month['release_date']).dt.strftime('%B')

Clean data to CSV

In [83]:
gross_budget.to_csv('Data/clean_data/gross_budget.csv')

In [84]:
gross_budget_genre_month.to_csv('Data/clean_data/gross_budget_genre.csv')

##### This notebook is dedicated to the exploration and cleaning of our dataset.we will seamlessly transition to our 'Analysis and Stats notebook', where we will delve into in-depth statistical examinations and derive meaningful insights.